Revit 2027 API
DirectContext3DHandleSettings.IsEqual Method
 Check if the contents of two instances of settings are equal.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	DirectContext3DHandleSettings other
)
Public Function IsEqual (
	other As DirectContext3DHandleSettings
) As Boolean
public:
bool IsEqual(
	DirectContext3DHandleSettings^ other
)
member IsEqual :
        other : DirectContext3DHandleSettings -> bool
Parameters
other DirectContext3DHandleSettings
 The settings to be compared.
Return Value
Boolean
 True for equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace